# FBXExportOptions Class

---
3D-Studio Max (FBX) Export options.
SystemObject Autodesk.Revit.DBFBXExportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FBXExportOptions

    Public Class FBXExportOptions

    public ref class FBXExportOptions

    type FBXExportOptions = class end
The FBXExportOptions type exposes the following members.
| Name| Description
---|---|---
| FBXExportOptions| Default constructor. Sets all options to their default values.
Top
| Name| Description
---|---|---
| LevelsOfDetailValue| The value of the levels of detail.
| StopOnError| Whether export process should stop when a view fails to export.
| UseLevelsOfDetail| True to use levels of detail, false otherwise.
| WithoutBoundaryEdges| True to export without boundary edges, false otherwise.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace